package ru.stimmax.kotlincource4.lessons.lesson08.homework
/*
1. Преобразование строк
Преобразование строк
Создайте функцию, которая будет анализировать входящие фразы и применять к ним различные преобразования, делая текст более ироничным или забавным.
Функция должна уметь распознавать ключевые слова или условия и соответственно изменять фразу.

Правила проверки и преобразования:

Если фраза содержит слово "невозможно":
Преобразование: Замените "невозможно" на "совершенно точно возможно, просто требует времени".
Если фраза начинается с "Я не уверен":
Преобразование: Добавьте в конец фразы ", но моя интуиция говорит об обратном".
Если фраза содержит слово "катастрофа":
Преобразование: Замените "катастрофа" на "интересное событие".
Если фраза заканчивается на "без проблем":
Преобразование: Замените "без проблем" на "с парой интересных вызовов на пути".
Если фраза содержит только одно слово:
Преобразование: Добавьте перед словом "Иногда," и после слова ", но не всегда".
Примеры Тестовых Фраз:

"Это невозможно выполнить за один день"
"Я не уверен в успехе этого проекта"
"Произошла катастрофа на сервере"
"Этот код работает без проблем"
"Удача"

 */

fun toPositiveString(str: String): String {
    return when {
        str.contains("невозможно", true) -> str.replace(
            "невозможно",
            "совершенно точно возможно, просто требует времени",
            true
        )

        str.startsWith("Я не уверен", true) -> "$str, но моя интуиция говорит об обратном"
        str.contains("катастрофа", true) -> str.replace("катастрофа", "интересное событие", true)
        str.endsWith("без проблем", true) -> str.replace("без проблем", "с парой интересных вызовов на пути")
        str.isNotBlank() && str.isNotEmpty() && str.trim().split(" ").size == 1 -> "Иногда $str, но не всегда"
        else -> "Неизвестная строка"
    }
}

/*
2. Извлечение даты из строки лога
У вас есть строка лога, например "Пользователь вошел в систему -> 2021-12-01 09:48:23" (данные могут быть любыми, но формат всегда такой).
Извлеките отдельно дату и время из этой строки и сразу распечатай их по очереди. Используй indexOf или split для получения правой части сообщения.
 */

fun formatDateEx08(date: String) {
    val listDate = date.split(" -> ")[1].split(" ")
    println("Дата - ${listDate[0]}. Время - ${listDate[1]}")

}

/*
3. Маскирование личных данных Дана строка с номером кредитной карты, например "4539 1488 0343 6467". Замаскируйте все цифры, кроме последних четырех, символами "*"
 */
fun maskCardNumber(cardNumber: String) {
    var s = cardNumber.split(" ")
    println("**** **** **** ${cardNumber.split(" ")[3]}")
}


/*
4. Форматирование адреса электронной почты.
У вас есть электронный адрес, например "username@example.com". Преобразуйте его в строку "username [at] example [dot] com", используя функцию replace()
 */

fun formatEmailEx08(email: String): String {
    val tmp = email.split("@")
    val tmp2 = tmp[1].split('.')
    return "${tmp[0]} [at] ${tmp2[0]} [dot] ${tmp2[1]}"
}

/*
5. Извлечение имени файла из пути.
Дан путь к файлу, например "C:/Пользователи/Документы/report.txt" или "D:/good.themes/dracula.theme" (может быть любым). Извлеките название файла с расширением.
 */

fun getFileNameFromAbsoluteName(path: String): String{
    val tmp = path.split('/')
    return tmp[tmp.size-1].substring(0,tmp[tmp.size-1].indexOf('.'))
}

/*
6. Создание аббревиатуры из фразы.
У вас есть фраза, например "Котлин лучший язык программирования" (может быть любой с разделителями слов - пробел).
Создайте аббревиатуру из начальных букв слов (например, "ООП").

Используйте split. Используйте for для перебора слов. Используйте var переменную для накопления первых букв.
 */

fun task6(str: String){
    val tmp = str.split(' ')
    var s = ""
    for (t in tmp){
        s += t[0]
    }
    println(s)
}

fun main() {
    println(toPositiveString("Это невозможно выполнить за один день"))
    println(toPositiveString("Я не уверен в успехе этого проекта"))
    println(toPositiveString("Произошла катастрофа на сервере"))
    println(toPositiveString("Этот код работает без проблем"))
    println(toPositiveString("Удача"))

    formatDateEx08("Пользователь вошел в систему -> 2021-12-01 09:48:23")

    maskCardNumber("4539 1488 0343 6467")

    println(formatEmailEx08("username@example.com"))

    println(getFileNameFromAbsoluteName("C:/Пользователи/Документы/report.txt"))
    println(getFileNameFromAbsoluteName("D:/good.themes/dracula.theme"))
    println(getFileNameFromAbsoluteName("C:/Program Files (x86)/Warcraft III/_retail_/x86_64/gggg.txt"))

    task6("Используйте var переменную для накопления первых букв.")


}