package ru.stimmax.kotlincource4.lessons.lesson09.homework


fun main() {

    //Работа с массивами Array
    println("Работа с массивами Array")
    //1.Создайте массив из 5 целых чисел и инициализируйте его значениями от 1 до 5.
    val intArray1: Array<Int> = arrayOf(1, 2, 3, 4, 5)
    println("1.Создайте массив из 5 целых чисел и инициализируйте его значениями от 1 до 5 \n ${intArray1.joinToString()}")
    //2.Создайте пустой массив строк размером 10 элементов.
    val stringArray2: Array<String> = Array(10) { "" }
    println("1.Создайте массив из 5 целых чисел и инициализируйте его значениями от 1 до 5 \n ${stringArray2.joinToString()}")
    //3.Создайте массив из 5 элементов типа Double и заполните его значениями,
// являющимися удвоенным индексом элемента.


    val doubleArray: Array<Double> = Array<Double>(5) { it * 2.0 }
    println("Создайте массив из 5 элементов типа Double и заполните его значениями, являющимися удвоенным индексом элемента.")
    println(doubleArray.joinToString(" "))


//4.Создайте массив из 5 элементов типа Int.
// Используйте цикл, чтобы присвоить каждому элементу значение, равное его индексу, умноженному на 3.

    val intArray4: Array<Int?> = Array<Int?>(5) { it }
    for (x in intArray4.indices) {
        intArray4[x] = x * 3
    }
    println("4.Создайте массив из 5 элементов типа Int.")
    println(intArray4.joinToString())

//5.Создайте массив из 3 nullable строк. Инициализируйте его одним null значением и двумя строками.
    val stringArray5: Array<String?> = arrayOf(null, "2", "3")
    println("5.Создайте массив из 3 nullable строк. Инициализируйте его одним null значением и двумя строками.\n ${stringArray5.joinToString()}")


    //6.Создайте массив целых чисел и скопируйте его в новый массив в цикле.
    val intArray6: Array<Int> = arrayOf(1, 2, 3, 4, 5)
    val copyIntArray6 = arrayOf(0, 0, 0, 0, 0)
    for (x in intArray6.indices) {
        copyIntArray6[x] = intArray6[x]
    }
    println("6.Создайте массив целых чисел и скопируйте его в новый массив в цикле.")
    println(copyIntArray6.joinToString())

    //7.Создайте два массива целых чисел одинаковой длины. Создайте третий массив, вычев значения одного из другого. Распечатайте полученные значения.
    val intArray71 = arrayOf(11, 12, 13, 14, 15)
    val intArray72 = arrayOf(10, 10, 10, 10, 10)
    val intArray73 = Array(5) { intArray71[it] - intArray72[it] }
    println("Создайте два массива целых чисел одинаковой длины. Создайте третий массив, вычев значения одного из другого. Распечатайте полученные значения.")
    println(intArray73.joinToString())

    //8.Создайте массив целых чисел. Найдите индекс элемента со значением 5. Если значения 5 нет в массиве, печатаем -1. Реши задачу через цикл while.
    println("Создайте массив целых чисел. Найдите индекс элемента со значением 5. Если значения 5 нет в массиве, печатаем -1. Реши задачу через цикл while.")
    val intArray8: Array<Int> = arrayOf(1, 2, 3, 4, 5, 10)
    var i8 = 0
    var tmp = -1
    while (i8 <= intArray8.lastIndex) {
        if (intArray8[i8] == 5) {
            tmp = i8
            break
        }
        i8++
    }
    println(tmp)

    //9. Создайте массив целых чисел.
// Используйте цикл для перебора массива и вывода каждого элемента в консоль. Напротив каждого элемента должно быть написано “чётное” или “нечётное”.
    val intArray9 = arrayOf(1, 2, 3, 5, 6, 7, 8, 9, 10)
    for (x in intArray9) {
        println("Число - $x : ${if (x % 2 == 0) "четное" else "нечетное"} ")
    }


    //10. Создай функцию, которая принимает массив строк и строку для поиска. Функция должна находить в массиве элемент,
// в котором принятая строка является подстрокой (метод contains()). Распечатай найденный элемент.
    println(
        "Создай функцию, которая принимает массив строк и строку для поиска. Функция должна находить в массиве элемент, " +
                "в котором принятая строка является подстрокой (метод contains()). Распечатай найденный элемент."
    )
    fun findSubstringInArray(arr: Array<String>, str: String) {
        for (x in arr.indices) {
            if (arr[x].contains(str, true)) {
                println("Подстрока $str найдена в строке ${arr[x]}")
            }
        }
    }
    findSubstringInArray(arrayOf("Привет, как дела", "Выйду ночью в поле с конем", "пу-пу-пу, нехорошо"), "РИВ")


    //Работа со списками List
    //1.Создайте пустой неизменяемый список целых чисел.
    println("1.Создайте пустой неизменяемый список целых чисел.")
    val list1: List<Int> = emptyList()
    println(list1.joinToString())

    //2.Создайте неизменяемый список строк,
// содержащий три элемента (например, "Hello", "World", "Kotlin").
    val list2: List<String> = listOf("Hello", "World", "Kotlin")
    println(list2.joinToString())

    //3.Создайте изменяемый список целых чисел и инициализируйте его значениями от 1 до 5.
    val list3: MutableList<Int> = MutableList<Int>(5) { it + 1 }
    println(list3.joinToString())

    //4.Имея изменяемый список целых чисел, добавьте в него новые элементы (например, 6, 7, 8).
    val list4: MutableList<Int> = MutableList<Int>(5) { it + 1 }
    list4.add(6)
    list4.add(7)
    list4.add(8)
    println(list4.joinToString())

    //5.Имея изменяемый список строк, удалите из него определенный элемент (например, "World").
    val list5: MutableList<String> = mutableListOf("Hello", "World", "Kotlin")
    list5.remove("World")
    println(list5.joinToString())

    //6.Создайте список целых чисел и используйте цикл для вывода каждого элемента на экран.
    val list6: List<Int> = listOf(1, 2, 3, 4, 5)
    for (x in list6) {
        println(x)
    }

    //7.Создайте список строк и получите из него второй элемент, используя его индекс.
    val list7: List<String> = listOf("Hello", "World", "Kotlin")
    println(list7[1])

    //8.Имея изменяемый список чисел, измените значение элемента на
    //определенной позиции (например, замените элемент с индексом 2 на новое значение).
    println(
        ".Имея изменяемый список чисел, измените значение элемента на\n" +
                "    //определенной позиции (например, замените элемент с индексом 2 на новое значение)"
    )
    val list8: MutableList<Int> = mutableListOf<Int>(1, 2, 3, 4, 5)
    list8[2] = 10
    println(list8.joinToString())

    //9.Создайте два списка строк и объедините их в один новый список,
// содержащий элементы обоих списков. Реши задачу с помощью циклов.
    val list91 = listOf<String>("1", "2")
    val list92 = listOf<String>("3", "4")
    val list93 = mutableListOf<String>()
    for (x in list91) {
        list93.add(x)
    }
    for (x in list92) {
        list93.add(x)
    }

    //10.Создайте список целых чисел и найдите
// в нем минимальный и максимальный элементы используя цикл.
    println("10. Создайте список целых чисел и найдите в нем минимальный и максимальный элементы используй цикл")
    val list10 = listOf<Int>(4, 2, 6, 8, 2, 1, 33)
    println(list10.max())
    println(list10.min())

    //11.Имея список целых чисел, создайте новый список,
// содержащий только четные числа из исходного списка используя цикл.
    println(
        "Имея список целых чисел, создайте новый список, \n" +
                " содержащий только четные числа из исходного списка используя цикл."
    )

    val list11 = listOf<Int>(1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
    val mutableList11 = mutableListOf<Int>()
    for (x in list11) {
        if (x % 2 == 0) {
            mutableList11.add(x)
        }
    }
    println(mutableList11.joinToString())


    //Работа с Множествами Set
    //1.Создайте пустое неизменяемое множество целых чисел.
    println("1.Создайте пустое неизменяемое множество целых чисел.")
    val set1: Set<Int> = emptySet<Int>()

    //2.Создайте неизменяемое множество целых чисел, содержащее три различных элемента (например, 1, 2, 3).
    println("2.Создайте неизменяемое множество целых чисел, содержащее три различных элемента (например, 1, 2, 3).")
    val set2 = setOf<Int>(1, 2, 3)

    //3.Создайте изменяемое множество строк и инициализируйте его несколькими значениями (например, "Kotlin", "Java", "Scala").
   println("Создайте изменяемое множество строк и инициализируйте его несколькими значениями (например, \"Kotlin\", \"Java\", \"Scala\")")
    val set3 = mutableSetOf<String>("Kotlin", "Java", "Scala")
    println(set3.joinToString())

    //4.Имея изменяемое множество строк, добавьте в него новые элементы (например, "Swift", "Go").
    println("Имея изменяемое множество строк, добавьте в него новые элементы (например, \"Swift\", \"Go\").")
    val set4 = mutableSetOf<String>("Kotlin", "Java", "Scala")
    set4.add("Swift")
    set4.add("Go")
    println(set4.joinToString())

    //5.Имея изменяемое множество целых чисел, удалите из него определенный элемент (например, 2).
    println("Имея изменяемое множество целых чисел, удалите из него определенный элемент (например, 2)")
    val set5 = mutableSetOf<Int>(1,2,3)
    set5.remove(2)
    println(set5.joinToString())

    //6.Создайте множество целых чисел и используйте цикл для вывода каждого элемента на экран.
    println("Создайте множество целых чисел и используйте цикл для вывода каждого элемента на экран.")
    val set6 = setOf<Int>(1,2,3)
    for (x in set6){
        println(x)
    }
    //7.Создай функцию, которая принимает множество строк (set) и строку и проверяет, есть ли в множестве указанная строка.
// Нужно распечатать булево значение true если строка есть. Реши задачу через цикл.

    println("оздай функцию, которая принимает множество строк (set) и строку и проверяет, есть ли в множестве указанная строка.\n" +
            "// Нужно распечатать булево значение true если строка есть. Реши задачу через цикл.")
    fun stringInSetChecker(set: Set<String>, str: String ){
        var tmp = "false"
        for (x in set){
            if (x.equals(str, true)){
                tmp = "true"
            }
        }
        println(tmp)
    }

    stringInSetChecker(setOf("Kotlin","Java","Go"),"GssO")

    //8.Создайте неизменяемое множество строк и конвертируйте его в
// изменяемый список строк с использованием цикла.
    println("8.Создайте неизменяемое множество строк и конвертируйте его в\n" +
            " изменяемый список строк с использованием цикла.")
    val set8 = setOf<String>("Kotlin","Java","Go")
    val mutablelistFromSet8 = mutableSetOf<String>()
    for(x in set8){
        mutablelistFromSet8.add(x)
    }
    println(mutablelistFromSet8.joinToString())
}